# GetAlignmentStationLabels Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AlignmentStationLabel..::..GetAlignmentStationLabels Method
AlignmentStationLabel Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAlignmentStationLabels(Alignment) | Returns all alignment station labels placed on the given alignment. |
| GetAlignmentStationLabels(Alignment, ElementId) | Returns all alignment station labels placed on the given alignment in the given view. |

# See Also
AlignmentStationLabel Class
AlignmentStationLabel Members
Autodesk.Revit.DB.Infrastructure Namespace